art_share_api/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
  def index
    # @artwork = Artwork.all
    # render json: @artwork
    # if params[:user_id]
    #   render json: Artwork.users(params[:user_id])
    # end

      @user = User.find(params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "testing is working"], ["updated_at", "2022-06-30 16:06:38.733069"], ["id", 12]]
---
  def update
    @artwork = Artwork.find(params[:id])
    if @artwork.update(artwork_params)