art_share_api/app/controllers/artworkshares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 13], ["viewer_id", 38], ["created_at", "2022-06-30 16:15:28.875980"], ["updated_at", "2022-06-30 16:15:28.875980"]]
---
  def create
    @artworkshare = ArtworkShare.new(artworkshare_params)
    if @artworkshare.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]
---
  def destroy
    @artworkshare = ArtworkShare.find(params[:id])
    @artworkshare.destroy