art_share_api/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is cool"], ["user_id", 35], ["artwork_id", 8], ["created_at", "2022-06-30 19:13:10.774940"], ["updated_at", "2022-06-30 19:13:10.774940"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save