art_share_api/app/controllers/likes_controller.rb

     def index
    # @comment = Comment.all
    # render json: @comment
    #   debugger
    # if params[:user_id]
    #   @comments = Comment.where(user_id: params[:user_id])
    # elsif params[:artwork_id]
    #   @comments = Comment.where(artwork_id: params[:artwork_id])
    # else
    #   @comments = Comment.all
    # end
    # render json: @comments
    @likes = Like.where(like_params)
---
SELECT "likes".* FROM "likes" WHERE "likes"."likes_id" = $1  [["likes_id", 1]]

  def create
    @like = Like.new(like_params)
    if @like.save
---
INSERT INTO "likes" ("user_id", "likes_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 35], ["likes_id", 1], ["artwork_id", 8], ["created_at", "2022-06-30 21:22:07.139893"], ["updated_at", "2022-06-30 21:22:07.139893"]]