art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:query]
      @users = User.where('username LIKE (?)', "%#{params[:query]}%")
    else
    @users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "kyle74"], ["created_at", "2022-06-29 20:49:39.404299"], ["updated_at", "2022-06-29 20:49:39.404299"]]
---
  def create
    @user = User.new(user_params)
    if @user.save